Documents/ОказаниеУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>ОказаниеУслуг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.СтоимостьМатериалов</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиМатериалов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СКЛАДЫ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КЛИЕНТЫ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СОТРУДНИКИ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПереченьНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НОМЕНКЛАТУРА</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/СтоимостьМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>СтоимостьМатериалов</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Материал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НОМЕНКЛАТУРА</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выручка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НОМЕНКЛАТУРА</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КЛИЕНТЫ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Мастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СОТРУДНИКИ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ОказаниеУслуг/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	 
	//  //Движения.Управленческий.Записывать = Истина;
	//Регистр Управленческий
	//Первая проводка: Д 62(Дебиторская задолженность) - К 90 (Капитал) Розничная сумма
	//  //Движение = Движения.Управленческий.Добавить();
	//  //Движение.СчетДт = ПланыСчетов.Основной.ДебиторскаяЗадолженность;
	//  //Движение.СчетКт = ПланыСчетов.Основной.Капитал;
	//  //Движение.Период = Дата;
	//  //Движение.Сумма = ТекСтрокаПереченьНоменклатуры.сумма;
	//  //Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Клиенты] = Клиент;
	//Вторая проводка: Д 90 (капитал) - К 41 (товары) - себестоимость
	//  //Движение = Движения.Управленческий.Добавить();
	//  //Движение.СчетДт = ПланыСчетов.Основной.Капитал;
	//  //Движение.СчетКт = ПланыСчетов.Основной.Товары;
	//  //Движение.Период = Дата;
	//  //Движение.сумма = ТекСтрокаПереченьНоменклатуры.сумма;
	//  //Движение.КоличествоКт = ТекСтрокаПереченьНоменклатуры.Количество;
	
	//  //Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Материалы] = ТекСтрокаПерерченьНоменклатуры.номенклатура;
	
	// регистр СтоимостьМатериалов
	Движения.СтоимостьМатериалов.Записывать = Истина;
	Для Каждого ТекСтрокаПереченьНоменклатуры Из ПереченьНоменклатуры Цикл
		Движение = Движения.СтоимостьМатериалов.Добавить();
		Движение.Период = Дата;
		Движение.Материал = ТекСтрокаПереченьНоменклатуры.Номенклатура;
		Движение.Стоимость = ТекСтрокаПереченьНоменклатуры.Стоимость;
	КонецЦикла;
	Движения.Продажи.Записывать = истина;
	Для Каждого ТекСтрокаПереченьНоменклатуры Из ПереченьНоменклатуры Цикл
		
		// Регистр Продажи
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаПереченьНоменклатуры.Номенклатура;
		Движение.Клиент = Клиент;
		Движение.Мастер = Мастер;
		Движение.Количество = ТекСтрокаПереченьНоменклатуры.Количество;
		Движение.Выручка = ТекСтрокаПереченьНоменклатуры.Сумма;
		Движение.Стоимость = ТекСтрокаПереченьНоменклатуры.Стоимость * ТекСтрокаПереченьНоменклатуры.Количество;
	КонецЦикла;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
